# ElementIntersectsSolidFilter Constructor (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ElementIntersectsSolidFilter Constructor
ElementIntersectsSolidFilter Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ElementIntersectsSolidFilter(Solid) | Constructs a filter to match elements which intersect the given element. |
| ElementIntersectsSolidFilter(Solid, Boolean) | Constructs a filter to match elements which intersect the given element, with the option to match all elements not intersecting the given element. |

# See Also
ElementIntersectsSolidFilter Class
ElementIntersectsSolidFilter Members
Autodesk.Revit.DB Namespace